package com.test.java;

public class Item11_연산자 {
	
	public static void main(String[] args) {
		
		//[SUMMARY] 연산자 (2022. 3. 23. 오후 9:40:27)
		
		/*
		//산술 연산자
		//- +, -, *, /, %(mod, 나머지)
		//- 피연산자는 숫자형을 가진다.(정수, 실수)
		*/
		
		/*
		//비교 연산자
		//- >, >=, <, <=, ==(같다), !=(같지 않다)
		*/
		
		//System.out.println(age >= 19); //권장
		
		//System.out.println(19 <= age); //비권장
		
		/*
		//논리 연산자
		//- &&(and), ||(or), !(not)
		*/
		
		/*
		//대입 연산자, 할당 연산자
		//- +=, -=, *=, /=, %= : 복합 대입 연산자
		*/
		
		//계산하려는 값에 문자열이 있으면 값이 더해지지 않고 하나의 문자열로 만들어진다.
		
		/*
		//증감 연산자
		//	a. ++n: 전위 배치(전치) > 연산자 우선 순위가 가장 높음
		//	b. n++: 후위 배치(후치) > 연산자 우선 순위가 가장 낮음
		 */
		
		//조건 연산자
		//- A ? B : C  A=조건 / B=참값 / C=거짓값
		
	}

}
